{"sections":{"faq_banner_ihNyQk":{"type":"faq-banner","blocks":{"content_PxgCf8":{"type":"content","settings":{"image":"shopify:\/\/shop_images\/Frame_1484580838.png","image_mobile":"shopify:\/\/shop_images\/Frame_1484580839.png","image_overlay_opacity":100,"content_position":"middle_center","content_position_m":"middle_center","color__info":"#f3f4f6","color__info_m":"#f3f4f6","info_align":"center","info_align_m":"center","pretitle":"","heading_size":"medium","title":"Frequently Asked Questions","subtitle":"Your Questions, Our Answers","btn_label1":"","btn_url1":"","btn_label2":"","btn_url2":"","btn_label3":"","btn_url3":""}}},"block_order":["content_PxgCf8"],"name":"FAQ Banner","settings":{"full_width":true,"id_nav":"","banner_height":"adaptive","mobile_padding":true,"margin_top":0,"margin_bottom":0,"padding_top":0,"padding_bottom":0,"margin_top_m":0,"margin_bottom_m":0,"padding_top_m":0,"padding_bottom_m":0}},"hero_banner_RYCGja":{"type":"hero-banner","blocks":{"content_7mXEx8":{"type":"content","settings":{"image":"shopify:\/\/shop_images\/Frame_1484580838.png","image_mobile":"shopify:\/\/shop_images\/Frame_1484580839.png","image_overlay_opacity":100,"content_position":"middle_center","content_position_m":"middle_center","color__info":"#f3f4f6","color__info_m":"#f3f4f6","info_align":"center","info_align_m":"center","pretitle":"","heading_size":"medium","title":"Frequently Asked Question","subtitle":"Your Questions, Our Answers","btn_label1":"","btn_url1":"","btn_label2":"","btn_url2":"","btn_label3":"","btn_url3":""}}},"block_order":["content_7mXEx8"],"disabled":true,"settings":{"full_width":true,"id_nav":"","banner_height":"adaptive","mobile_padding":true,"margin_top":0,"margin_bottom":0,"padding_top":0,"padding_bottom":0,"margin_top_m":0,"margin_bottom_m":0,"padding_top_m":0,"padding_bottom_m":0}},"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"faq_section_pLwwmK":{"type":"faq-section","blocks":{"category_FFjqqB":{"type":"category","settings":{"title":"Men"}},"category_eGTmF4":{"type":"category","settings":{"title":"Women"}},"subcategory_yU6rUk":{"type":"subcategory","settings":{"title":"Quality","parent_category":"Men"}},"subcategory_8LBQBG":{"type":"subcategory","settings":{"title":"Product Styling","parent_category":"Men"}},"faq_t9EYpE":{"type":"faq","settings":{"category":"Men","subcategory":"Quality","title_1":"Why is Fairway & Greene apparel more expensive than other golf brands?","faq_content_1":"<p>Fairway & Greene products are crafted with premium materials like Italian Baruffa Merino wool, moisture-wicking tech blends, and American-made construction. You're paying for unmatched quality, comfort, and lasting durability on and off the course.<\/p>","title_2":"What makes this better than other golf polos?","faq_content_2":"<p>Our polos offer multi-directional stretch, UPF 50+ protection, and chambray detailing for a refined look. They're built to move with your swing and look polished in the clubhouse—combining timeless design with cutting-edge tech.<\/p>","title_3":"Is Fairway & Greene gear worth the investment?","faq_content_3":"<p>Absolutely. Each piece is built to last season after season, with smart detailing, luxurious fabrics, and tailored fits. Whether you're on the course or dressing casually, you're getting performance and polish in one.<\/p>","title_4":"Do I really need all these technical features if I just play golf casually?","faq_content_4":"<p>Yes. Features like moisture-wicking, UPF protection, and breathable construction keep you comfortable and protected, even during casual rounds or sunny days. You’ll notice the performance even when you’re not swinging.<\/p>","title_5":"What sets your sweaters apart from others?","faq_content_5":"<p>Our Baruffa Merino wool is imported from Italy and known for exceptional softness, temperature regulation, and durability. When combined with a windproof lining, it becomes a versatile, elevated outerwear piece that performs far beyond a traditional sweater.<\/p>","title_6":"Can I wear this off the course too?","faq_content_6":"<p>Definitely. Fairway & Greene pieces are designed for both performance and lifestyle wear. Our versatile styles and refined detailing make them perfect for the course, the office, or a weekend getaway.<\/p>","title_7":"Why are many of your polos made in the USA?","faq_content_7":"<p>Because quality matters. Our USA-made polos reflect a commitment to craftsmanship and high performance, using premium yarns and small-batch production standards that support domestic manufacturing and ensure superior quality control.<\/p>","title_8":"How do I care for these garments to make them last?","faq_content_8":"<p>Most styles are machine washable on gentle cycles with low heat drying. For Merino wool sweaters, dry cleaning or hand washing is recommended. Follow care labels for best results—these pieces are designed to go the distance.<\/p>","title_9":"Will these shirts shrink or fade over time?","faq_content_9":"<p>Not if properly cared for. Fairway & Greene uses durable, fade-resistant materials and pre-washed techniques to ensure the garments hold their color, shape, and softness—even after many washes.<\/p>","title_10":"","faq_content_10":""}},"faq_Kzc8HA":{"type":"faq","settings":{"category":"Men","subcategory":"Product Styling","title_1":"What makes the layering pieces different from traditional pullovers?","faq_content_1":"<p>Pullovers like The Valley or Coughlin Quarter Zips offer a luxurious feel, precision fit, and temperature regulation through technical fabrics. They're designed for motion with built-in stretch and long-term durability.<\/p>","title_2":"How is Fairway & Greene different from fast-fashion or big-box golf apparel?","faq_content_2":"<p>Fairway & Greene prioritizes quality over quantity. We design timeless pieces that last, use premium materials, and maintain small-batch production standards that fast-fashion can't match. It’s investment wear, not throwaway gear.<\/p>","title_3":"What makes Fairway & Greene polos feel more premium?","faq_content_3":"<p>Every detail is intentional—from the moisture-wicking stretch fabric and soft collar band to the contrast chambray placket and cross-stitched buttons. It’s built for lasting quality, not just looks.<\/p>","title_4":"Is this really better than a $50 polo from a big-box store?","faq_content_4":"<p>Yes. With better stitching, finer yarns, better color retention, and performance features like UPF protection and stretch recovery, our polos outperform budget brands in fit, feel, and longevity.<\/p>","title_5":"What’s the benefit of UPF 50+ sun protection in your shirts?","faq_content_5":"<p>UPF 50+ blocks 98% of harmful UV rays. It’s built into the fabric—not sprayed on—so it lasts as long as the garment and protects your skin during long rounds or outdoor days.<\/p>","title_6":"Are your pieces breathable for hot summer golf days?","faq_content_6":"<p>Absolutely. Our jersey and pique knit polos feature lightweight construction and side vents for airflow. Plus, moisture-wicking tech keeps you dry and cool all day.<\/p>","title_7":"Is the Baruffa Merino wool really that special?","faq_content_7":"<p>Yes—it's sourced from one of Italy’s top mills, offering superior softness, wrinkle resistance, and temperature regulation. Combined with a windproof lining, it’s high-performance luxury.<\/p>","title_8":"Do these polos hold up after multiple washes?","faq_content_8":"<p>Yes. They're made with fade-resistant dyes, stretch recovery, and reinforced seams. With proper care, they maintain color and structure for years—no sagging, shrinking, or pilling.<\/p>","title_9":"How do your vests compare to other brands?","faq_content_9":"<p>Fairway & Greene vests combine sleek design with smart functionality—like dual-direction zippers, stretch tech fabrics, and weather resistance. They're equally stylish layered over a polo or worn off the course.<\/p>","title_10":"Can I wear this to work or just on the course?","faq_content_10":"<p>Many of our customers wear Fairway & Greene polos, vests, and sweaters to the office, casual dinners, or events. The styling is refined and timeless, without looking overly sporty.<\/p>"}},"faq_ThdkaR":{"type":"faq","settings":{"category":"Men","subcategory":"Product Styling","title_1":"What makes Fairway & Greene different from athletic brands like Nike or Under Armour?","faq_content_1":"<p>We focus on timeless design with premium, small-batch craftsmanship. While athletic brands focus on volume, we prioritize materials, fit, and finish—blending classic style with modern performance.<\/p>","title_2":"Is this good for travel?","faq_content_2":"<p>Definitely. Many pieces are lightweight, wrinkle-resistant, and layer easily. From a plane to a dinner to a round of golf, you’ll be comfortable and well-dressed without needing to change.<\/p>","title_3":"Why should I choose Fairway & Greene over other luxury golf brands?","faq_content_3":"<p>We blend performance with polish, focusing on wearable luxury. While others chase trends, we deliver timeless pieces made in the USA or with the world’s best materials, built to last and look good doing it.<\/p>","title_4":"Will I sweat through this in hot weather?","faq_content_4":"<p>No. Moisture-wicking tech pulls sweat away from the body and dries quickly, while breathable fabric and side vents allow airflow. You’ll stay cooler and drier, round after round.<\/p>","title_5":"Do your products ever go on sale?","faq_content_5":"<p>We occasionally offer select seasonal sales, but our core products are priced to reflect quality and craftsmanship. These are investment pieces designed for years of wear.<\/p>","title_6":"Do you offer extended sizes?","faq_content_6":"<p>Yes, many of our styles offer extended sizing. Our cuts are tailored but not tight, and our stretch fabrics ensure a comfortable, flexible fit. Reach out if you need help finding your size.<\/p>","title_7":"","faq_content_7":"","title_8":"","faq_content_8":"","title_9":"","faq_content_9":"","title_10":"","faq_content_10":""}},"faq_bipCPb":{"type":"faq","settings":{"category":"Women","subcategory":"","title_1":"Why is Fairway & Greene Women’s apparel priced higher than other brands?","faq_content_1":"<p>We use premium materials, from moisture-wicking UPF 50+ stretch fabrics to extra-fine Merino wool, and design every piece with superior tailoring, function, and versatility. You're not just buying a golf piece—you're investing in timeless performance wear.<\/p>","title_2":"Is it really worth investing in Fairway & Greene Women’s styles?","faq_content_2":"<p>Absolutely. These pieces are built for years of wear, offering style, sun protection, and technical performance in any setting—from the course to errands, brunch, or travel. They won’t fade, stretch out, or go out of style after one season.<\/p>","title_3":"Can I wear this even if I’m not a golfer?","faq_content_3":"<p>Definitely. Many customers love the flattering fits, UPF protection, and breathable comfort for everyday wear. Whether you're running errands, meeting friends, or heading outdoors, these styles move with you and elevate any outfit.<\/p>","title_4":"How is this better than fast fashion or athleisure brands?","faq_content_4":"<p>Fast fashion sacrifices quality and durability. Fairway & Greene delivers high-end performance apparel with sophisticated style—built to endure, flatter, and protect. Our details, materials, and finishes are leagues above mass-market brands.<\/p>","title_5":"Is this really functional or just for style?","faq_content_5":"<p>Both. Every piece is thoughtfully constructed with features like stretch waistbands, sun protection, wicking fabric, and smart pocketing—without sacrificing a polished, feminine look. Performance meets lifestyle in every detail.<\/p>","title_6":"What makes your skorts better than others?","faq_content_6":"<p>Our skorts feature built-in UPF 50+, breathable wicking fabric, comfortable stretch waists, and interior shorts designed for coverage and movement. They’re as functional as they are flattering.<\/p>","title_7":"Is the UPF sun protection permanent?","faq_content_7":"<p>Yes. Unlike topical sunscreens, the UPF 50+ protection is woven into the fabric, offering reliable sun safety that won’t wash out or wear off over time.<\/p>","title_8":"Do these pieces wrinkle or shrink in the wash?","faq_content_8":"<p>Nope. Our polyester-spandex blends resist wrinkling and maintain their shape, wash after wash. Always check care labels, but most items are machine washable and low-maintenance.<\/p>","title_9":"How does this compare to Lululemon or Athleta?","faq_content_9":"<p>Fairway & Greene is more tailored, polished, and built with golfers and outdoor enthusiasts in mind. Our pieces are refined enough for the course or a casual dinner, not just the gym or yoga studio.<\/p>","title_10":"Can I travel with these pieces?","faq_content_10":"<p>Yes—many styles are wrinkle-resistant, lightweight, and breathable, making them perfect for packing. From skorts to dresses to layering pieces, they’re ready for resort wear, golf getaways, or everyday adventures.<\/p>"}},"faq_CdEVE7":{"type":"faq","settings":{"category":"Women","subcategory":"","title_1":"Do you offer pieces for different body types?","faq_content_1":"<p>Our cuts are designed to flatter a wide range of shapes, with flexible stretch fabric and silhouettes that move with you. Skorts have stretch waists and shorts built-in, and tops are roomy without looking oversized.<\/p>","title_2":"What makes the Abbey Windsweater worth the price?","faq_content_2":"<p>It’s crafted from 100% extra-fine Merino wool for unparalleled softness and warmth, with a wind-blocking interior lining. It looks like a luxury sweater but functions like outerwear—timeless, elegant, and built to last.<\/p>","title_3":"Is this only for on-course wear?","faq_content_3":"<p>Not at all. Fairway & Greene Women’s styles are known for course-to-clubhouse versatility. They’re equally suited for errands, casual events, or weekend getaways—no wardrobe change required.<\/p>","title_4":"Are your styles trendy or classic?","faq_content_4":"<p>They’re timeless—with thoughtful colorways and refined silhouettes that stay stylish season after season. Fairway & Greene is about enduring elegance with performance built in.<\/p>","title_5":"Why would I spend $100+ on a polo when I can get one for $30?","faq_content_5":"<p>Cheaper polos often fade, stretch out, or cling after a few washes. Ours are built to last—with UPF 50+, moisture-wicking tech, polished design, and shape-retaining fabric that still looks brand new after years of wear.<\/p>","title_6":"I don’t golf—would I even wear this?","faq_content_6":"<p>Absolutely. These pieces are designed to move with you all day—whether you're walking the dog, grabbing coffee, or heading to lunch. It’s lifestyle wear with performance built in.<\/p>","title_7":"Do you have anything that doesn’t look like ‘golf clothes’?","faq_content_7":"<p>Yes! Our styles are modern, flattering, and easy to wear on and off the course. Think versatile skorts, sleek dresses, quarter zips, and full zips that work just as well at brunch as they do at tee time.<\/p>","title_8":"Do your pieces run small or large?","faq_content_8":"<p>Most styles run true to size and include flexible stretch. Skorts have forgiving waistbands, and tops offer room to move without being boxy. If unsure, message us—we’re happy to help with sizing!<\/p>","title_9":"Is this stuff actually comfortable for all-day wear?","faq_content_9":"<p>Yes—comfort is our #1 priority. Every piece is made with soft, breathable, lightweight materials that wick moisture and stretch as you move. It’s performance gear that feels like luxury loungewear.<\/p>","title_10":"Is this just another ‘athleisure’ brand?","faq_content_10":"<p>Not at all. Fairway & Greene blends performance and polish—combining the comfort of activewear with a timeless, tailored look that elevates your entire outfit.<\/p>"}},"faq_XYE89f":{"type":"faq","settings":{"category":"Women","subcategory":"","title_1":"Does the UPF 50+ fade after washing?","faq_content_1":"<p>Nope! The sun protection is built into the fibers—not sprayed on—so it lasts as long as the garment does. It's one of the reasons our gear is made for real, outdoor life.<\/p>","title_2":"Are these sweatproof for hot summer days?","faq_content_2":"<p>Yes. Every item is moisture-wicking and breathable to keep you dry and cool—even on humid rounds or long walks. No sticky, clingy fabric—just comfort that performs.<\/p>","title_3":"What makes this different from brands like Athleta or Lululemon?","faq_content_3":"<p>We focus on premium golf and lifestyle crossover gear—not gym wear. Our cuts are tailored, our fabrics are polished, and our goal is to make you feel stylish and confident in every setting.<\/p>","title_4":"","faq_content_4":"","title_5":"","faq_content_5":"","title_6":"","faq_content_6":"","title_7":"","faq_content_7":"","title_8":"","faq_content_8":"","title_9":"","faq_content_9":"","title_10":"","faq_content_10":""}}},"block_order":["category_FFjqqB","category_eGTmF4","subcategory_yU6rUk","subcategory_8LBQBG","faq_t9EYpE","faq_Kzc8HA","faq_ThdkaR","faq_bipCPb","faq_CdEVE7","faq_XYE89f"],"settings":{"full_width":false,"margin_top":0,"margin_bottom":0,"padding_top":32,"padding_bottom":32,"margin_top_m":0,"margin_bottom_m":0,"padding_top_m":32,"padding_bottom_m":32}}},"order":["faq_banner_ihNyQk","hero_banner_RYCGja","main","faq_section_pLwwmK"]}